app/controllers/dollars_controller.rb

SELECT "dollars".* FROM "dollars" WHERE "dollars"."dollar_type" = 2 ORDER BY created_at DESC LIMIT 1
SELECT "dollars".* FROM "dollars"
---
  def index
     unless params[:dollar_type].nil?
       @dollars = Dollar.find(:all, :conditions =>  {:dollar_type => params[:dollar_type]}, :order => 'created_at DESC', :limit => 1)

     else
    @dollars = Dollar.all